/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "满足以下%1$[任一]@条件：";
"%[All]@ of the following are true" = "满足以下%1$[全部]@条件：";
"%[None]@ of the following are true" = "满足以下%1$[无]@条件：";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[种类]@ 是 %2$[任意]@";
"%[Kind]@ is %[applications]@" = "%1$[种类]@ 是 %2$[应用程序]@";
"%[Kind]@ is %[documents]@" = "%1$[种类]@ 是 %2$[文稿]@";
"%[Kind]@ is %[folders]@" = "%1$[种类]@ 是 %2$[文件夹]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[种类]@ 是 %2$[图像]@ %3$[全部]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[种类]@ 是 %2$[图像]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[种类]@ 是 %2$[图像]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[种类]@ 是 %2$[图像]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[种类]@ 是 %2$[图像]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[种类]@ 是 %2$[图像]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[种类]@ 是 %2$[音乐]@ %3$[全部]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[种类]@ 是 %2$[音乐]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[种类]@ 是 %2$[音乐]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[种类]@ 是 %2$[音乐]@ %3$[已购买]@";
"%[Kind]@ is %[PDF]@" = "%1$[种类]@ 是 %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[种类]@ 是 %2$[演示文稿]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[种类]@ 是 %2$[文本]@ %3$[全部]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[种类]@ 是 %2$[文本]@ %3$[纯文本]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[种类]@ 是 %2$[文本]@ %3$[多信息文本]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[种类]@ 是 %2$[文本]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[种类]@ 是 %2$[文本]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[种类]@ 是 %2$[文本]@ %3$[源代码]@";
"%[Kind]@ is %[movies]@" = "%1$[种类]@ 是 %2$[影片]@";
"%[Kind]@ is %[other]@ %@" = "%1$[种类]@ 是 %2$[其他]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ 是 %2$[过去]@ %3$@ %4$[天的]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ 是 %2$[过去]@ %3$@ %4$[周的]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ 是 %2$[过去]@ %3$@ %4$[月的]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ 是 %2$[过去]@ %3$@ %4$[年的]@";
"%@ is %[exactly]@ %@" = "%1$@ 是 %2$[正好等于]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ 是 %2$[早于]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ 是 %2$[晚于]@ %3$@";
"%@ is %[today]@" = "%1$@ 是 %2$[今天]@";
"%@ is %[yesterday]@" = "%1$@ 是 %2$[昨天]@";
"%@ is %[this week]@" = "%1$@ 是 %2$[本周]@";
"%@ is %[this month]@" = "%1$@ 是 %2$[本月]@";
"%@ is %[this year]@" = "%1$@ 是 %2$[今年]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[包含]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[开头为]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[结尾为]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[是]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[匹配]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[任何]@";
"%@ %[yes]@" = "%1$@ %2$[是]@";
"%@ %[no]@" = "%1$@ %2$[不]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[文件可见性]@ %2$[可见项]@";
"%[File invisible]@ %[invisible items]@" = "%1$[文件可见性]@ %2$[不可见项]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[文件可见性]@ %2$[可见或不可见]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Raw 查询]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[文件扩展名]@ %2$[是]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[等于]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[大于]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[小于]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[不等于]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ 含有 %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[等于]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[等于]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[等于]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[小于]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[小于]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[小于]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[大于]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[大于]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[大于]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[不等于]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[不等于]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[不等于]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[等于]@ %3$@ 小时 %4$@ 分钟 %5$@ 秒钟";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[小于]@ %3$@ 小时 %4$@ 分钟 %5$@ 秒钟";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[大于]@ %3$@ 小时 %4$@ 分钟 %5$@ 秒钟";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[不等于]@ %3$@ 小时 %4$@ 分钟 %5$@ 秒钟";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[匹配文本的项]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[系统文件]@ %2$[包括]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[系统文件]@ %2$[不包括]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight 项]@ %2$[包括]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight 项]@ %2$[不包括]@";

